### Concatation

In [3]:
import pandas as pd
import numpy as np

In [4]:

data_one = {'A': ['A0', 'A1', 'A2', 'A3'],'B': ['B0', 'B1', 'B2', 'B3']}

In [5]:
data_two = {'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']}

In [7]:
df1 = pd.DataFrame(data_one)
df2 = pd.DataFrame(data_two)

In [8]:
df1

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [9]:
df2

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [10]:
new_df = pd.concat([df1,df2],axis = 1)

In [11]:
new_df

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [15]:
#concating with join
df1.join(df2)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [16]:
new_df_col = pd.concat([df1,df2],axis = 0)
new_df_col

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [18]:
new_df_col.index = range(len(new_df_col)) 
new_df_col

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
4  NaN  NaN   C0   D0
5  NaN  NaN   C1   D1
6  NaN  NaN   C2   D2
7  NaN  NaN   C3   D3

In [19]:
new_df_col.fillna(0)

    A   B   C   D
0  A0  B0   0   0
1  A1  B1   0   0
2  A2  B2   0   0
3  A3  B3   0   0
4   0   0  C0  D0
5   0   0  C1  D1
6   0   0  C2  D2
7   0   0  C3  D3

### Axis 0 .but columns match up

In [23]:
df2.columns = df1.columns

## Merge Dataset
in terms of inner, outer, left, right

In [25]:
reg = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
log = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [28]:
reg

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [29]:
log

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [34]:
#inner join joins two dataframe which is common, this is default in merge method
l1 = pd.merge(reg,log,how = 'inner')

In [33]:
l1

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

In [36]:
l1 = pd.merge(reg,log,how = 'outer',on = 'name')
l1

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [ ]:
l1 = pd.merge(reg,log,how = 'outer',on = 'name')
l1

In [37]:
l1 = pd.merge(reg,log,how = 'left',on = 'name')
l1

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

### join on index or column

In [38]:
#first changing index for learning
registrations = registrations.set_index("name")

In [39]:
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [40]:
pd.merge(registrations,log,left_index = True,right_on = 'name')

   reg_id  log_id    name
1       1       2  Andrew
3       2       4    Bobo

### Dealing with differing key column names in joined tables

In [41]:
registrations =registrations.reset_index()

In [42]:
registrations

     name  reg_id
0  Andrew       1
1    Bobo       2
2  Claire       3
3   David       4

In [43]:
log

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [45]:
registrations.columns = ["reg-name",'reg_id']

In [46]:
registrations

  reg-name  reg_id
0   Andrew       1
1     Bobo       2
2   Claire       3
3    David       4

In [51]:
l2 = pd.merge(registrations,log,how = 'left',left_on='reg-name',right_on = 'name')

In [55]:
l2.fillna(0,inplace= True)

In [57]:
l2

  reg-name  reg_id  log_id    name
0   Andrew       1     2.0  Andrew
1     Bobo       2     4.0    Bobo
2   Claire       3     0.0       0
3    David       4     0.0       0